Seperti telah kita pelajari, untuk meng-akses database ada beberapa perangkat lunak yang dapat digunakan. Secara khusus pada pelatihan **("Data Analytics with Python+SQL")** ini kita akan fokus untuk menggunakan dua diantaranya; MySQL dan PostgreeSQL.
<hr> 

# Akses MySQL dengan Python

Berikut ini akan diperlihatkan langkah-langkah untuk mengakses MySQL dengan Python:

## Instalasi Modul MySQL Connector

Untuk dapat menghubunkan Python dengan MySQL, diperlukan mudul (Packages) yang berisi fungsi-fungsi  dan perintah yang dapat dipergunakan dalam mengakses MySQL.

In [13]:
pip install mysql-connector

Requirement already satisfied: mysql-connector in c:\users\user\anaconda3\lib\site-packages (2.2.9)
Note: you may need to restart the kernel to use updated packages.

## Aktifkan MySQL

**Jangan pernah lupa** mengaktifkan MySQL melalui aplikasi XAMPP untuk dapat menghubungkan MySQL dengan Python. Klik **Start** pada tombol **Apache** dan **MySQL** dan pastikan berwarna hijau, seperti terlihat pada gambar dibawah ini. 

<img style="float: center; margin: 0px 0px 0px 0px; width:80%" src="https://github.com/dsciencelabs/JNE_Data_Analytics_PySQL/blob/main/images/bab1/xampp8.png?raw=true"/>

## Koneksikan Python ke SQL

Pertama-tama kita membutuhkan modul `mysql.connector` untuk membuat koneksi ke MySQL. Kemudian kita membuat koneksi dengan memanggil fungsi `connect()` dan parameter

* `host`  : Hosting (Alamat penyimpanan database), bisa lokal dan situs tertentu.
* `user`  : Nama user yang dapat melakukan akses ke database tersebut
* `passwd`: Sandi yang hanya diberikan kepad user yang memiliki hak akses ke database

Perhatikan, koding berikut:

In [33]:
import mysql.connector

db1 = mysql.connector.connect(
  host='localhost',
  user='bakti',
  passwd='123'
)

if db1.is_connected():
  print('Berhasil terhubung ke database')

Berhasil terhubung ke database

**Catatan:**
<br>
Jika anda ingin terkoneksi ke MySQL secara default, tanpa menggunakan **Password**. Dapat mengikuti koding berikut:

In [34]:
import mysql.connector

db2 = mysql.connector.connect(
  host='localhost',
  user='root',
  passwd=''
)

if db2.is_connected():
  print('Berhasil terhubung ke database')

Berhasil terhubung ke database

## Membuat Database

Kita sudah berhasil membuat objek `db1` dan `db2` yang akan bertugas sebagai konektor ke MySQL. Kemudian kita masih membutuhkan satu lagi objek yaitu `cursor` untuk mengeksekusi perintah SQL atau query. Karena objek tersebut berada di dalam objek `db1` dan `db2`, sehingga untuk membuat objek `cursor` adalah sebagai berikut:

In [ ]:
cursor = db1.cursor()
cursor.execute('CREATE DATABASE jne')

atau,

In [ ]:
cursor = db2.cursor()
cursor.execute('CREATE DATABASE JNE')

**Pertanyaan:** Dari kedua koding tersebut diatas, apakah yang menurut anda berbeda?

Cara lain,

In [ ]:
cursor = db2.cursor()
sql = 'CREATE DATABASE JNE'
cursor.execute(sql)

**Catatan:** Untuk mengecek database yang telah dibuat, buka Phpmyadmin dengan cara klik dua kali pada tombol `admin` pada aplikasi XAMPP yang telah diaktifkan sebelumnya. Berikut ini adalah hasilny; <img style="float: center; margin: 0px 0px 0px 0px; width:80%" src="https://github.com/dsciencelabs/JNE_Data_Analytics_PySQL/blob/main/images/bab1/dbjne.png?raw=true"/>

## Membuat Tabel

Cara membuat tabel sama seperti cara membuat database. Kita tinggal masukan perintah SQL atau query ke dalam method execute(). Namun sebelum itu, pastikan kontektor sudah diberikan parameter database untuk menentukan database mana yang akan digunakan.

In [28]:
db3 = mysql.connector.connect(
  host='localhost',
  user='bakti',
  passwd='123',
  database='jne'
)

Pada kode di atas kita memberikan parameter database="jne". Artinya kita akan mengunakan database tersebut pada koneksi objek `db3`. Sehingga,  untuk membuat tabel pada database dapat dilakukan dengan kode berikut;

In [ ]:
cursor = db3.cursor()
sql = '''CREATE TABLE karyawan (
            karyawan_id INT AUTO_INCREMENT PRIMARY KEY,
            nama VARCHAR(255),
            email Varchar(255))'''

cursor.execute(sql)

**Pertanyaan:** 

* Mengapa koding SQL diatas menggunkan tanda tiga tanda petik ''' ?
* Apakah memungkinkan, jika anda menambahkan tabel baru ke database JNE dengan menggunakan user lain?
* Bagaimana caranya untuk menambahkan user baru yang dapat mengakses database anda?

## Insert Data

Setelah membuat tabel, berikutnya kita akan mencoba menambahkan data ke tabel. Perhatikan koding berikut:

3 rows affected.

[]

In [13]:
%sql $mysql_con select * from employee

3 rows affected.

[(1, 'Andi', 21), (2, 'Budi', 23), (3, 'Cici', 32)]

<hr> 

## 2. Akses PostgreSQL

In [21]:
# database url: 
# engine://username:password@host:port/database
postgre_con = 'postgresql://postgres:12345@localhost:5432/tokoku'

In [16]:
# aktivasi query special postgres: pip install pgspecial
! pip install pgspecial

Requirement already satisfied: pgspecial in c:\python37\lib\site-packages (1.11.10)
Requirement already satisfied: click>=4.1 in c:\python37\lib\site-packages (from pgspecial) (7.0)
Requirement already satisfied: sqlparse>=0.1.19 in c:\python37\lib\site-packages (from pgspecial) (0.2.4)
Requirement already satisfied: psycopg2>=2.7.4 in c:\python37\lib\site-packages (from pgspecial) (2.7.6.1)

In [23]:
# list databases
%sql $postgre_con \l

7 rows affected.

[('gudang',
  'postgres',
  'UTF8',
  'English_Indonesia.1252',
  'English_Indonesia.1252',
  None),
 ('lin_flask',
  'postgres',
  'UTF8',
  'English_Indonesia.1252',
  'English_Indonesia.1252',
  None),
 ('postgres',
  'postgres',
  'UTF8',
  'English_Indonesia.1252',
  'English_Indonesia.1252',
  None),
 ('template0',
  'postgres',
  'UTF8',
  'English_Indonesia.1252',
  'English_Indonesia.1252',
  '=c/postgres\npostgres=CTc/postgres'),
 ('template1',
  'postgres',
  'UTF8',
  'English_Indonesia.1252',
  'English_Indonesia.1252',
  '=c/postgres\npostgres=CTc/postgres'),
 ('tokoku',
  'postgres',
  'UTF8',
  'English_Indonesia.1252',
  'English_Indonesia.1252',
  None),
 ('ujicoba',
  'postgres',
  'UTF8',
  'English_Indonesia.1252',
  'English_Indonesia.1252',
  None)]

In [24]:
%sql $postgre_con \d

4 rows affected.

[('public', 'coba', 'table', 'postgres'),
 ('public', 'haha', 'table', 'postgres'),
 ('public', 'pegawai', 'table', 'postgres'),
 ('public', 'pegawai_id_seq', 'sequence', 'postgres')]

In [25]:
%sql $postgre_con \dt

3 rows affected.

[('public', 'coba', 'table', 'postgres'),
 ('public', 'haha', 'table', 'postgres'),
 ('public', 'pegawai', 'table', 'postgres')]

In [26]:
%sql $postgre_con create table avengers (id int, name varchar(255), age int)

Done.

[]

In [27]:
%sql $postgre_con \d

5 rows affected.

[('public', 'avengers', 'table', 'postgres'),
 ('public', 'coba', 'table', 'postgres'),
 ('public', 'haha', 'table', 'postgres'),
 ('public', 'pegawai', 'table', 'postgres'),
 ('public', 'pegawai_id_seq', 'sequence', 'postgres')]

In [28]:
%sql $postgre_con insert into avengers values (1, 'Capt. America', 23), (2, 'Iron Man', 24)

2 rows affected.

[]

In [29]:
%sql $postgre_con select * from avengers

2 rows affected.

[(1, 'Capt. America', 23), (2, 'Iron Man', 24)]

<hr> 

## 3. Akses SQLite

In [3]:
# database url: 
# engine://username:password@host:port/database
sqlite_con = 'sqlite://:@/dc.db'

In [4]:
%sql $sqlite_con create table justiceleague (id int, name varchar(255), age int)

Done.

[]

In [5]:
%sql $sqlite_con insert into justiceleague values (1, 'Superman', 28), (2, 'Batman', 29)

2 rows affected.

[]

In [6]:
%sql $sqlite_con select * from justiceleague

Done.

[(1, 'Superman', 28), (2, 'Batman', 29)]